import React from 'react';
import './Footer.css'

const Footer = () => {
    return (
        <div>
           <div className="footer-container">
               <h2>How React Work?</h2>
               <p>রিয়েক্ট এর সাহায্য আমরা  কম্পোনেন্ট তৈরি করতে পারি, এবং রিয়েক্টএ সেটাকে রি ইউজ করতে পারি, জাভাস্ক্রিপ্ট কোড কে Html কোড এ কনভার্ট করার জন্য 
রিয়েক্ট প্রয়োজন পরে, রিয়েক্ট ডম html কোডকে যেটা রিয়েক্ট কম্পোনেন্ট থেকে আনা হয় সেটা মেইন html পেইজ এর মধ্যে ইনজেক্ট করতে সাহায্য করে, এবং
এই পুরো প্রসেস টা চলে পেইজ রিলোড না হয়েই, অর্থাত পেইজ টা রিলোড হওয়া ছাড়াই ডাইনামিক ভাবেই html কোড গুলি ডম এর মধ্যে জেনারেট হয়, এভাবেই রিয়েক্ট কাজ করে এই কারনে রিয়েক্ট অনেক  ফার্স্ট ও ইন্সেটেট কাজ করে।।</p>
               <h2>How useState Work:</h2>
               <p>useState ফাংশনাল কম্পোনেন্ট এ state ভেরিয়েবল কে রাখতে দেয়, 
use State হল একটি হুক ফাংশন
এবং এটি আমাদের কে একটি array রিটার্ন করে সেই array তে দুটো এলিমেন্ট থাকে প্রথম এলিমেন্ট টা যেকোনো নাম দেওয়া যায় এবং সেকেন্ড হল useState একটা ফাংশন দেয় এলিমেন্ট টাকে চেঞ্জ করার জন্য,  এবং useState যতবার প্রয়জন ব্যবহার করা যায়...</p>
           </div>
        </div>
    );
};

export default Footer;